app/controllers/notes_controller.rb

  def show
    @note = Note.find(params[:id])
---
SELECT "notes".* FROM "notes" WHERE "notes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
    @note = Note.new(note_params)

    if @note.save
---
INSERT INTO "notes" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Hola mundo!"], ["body", "Desarrollo de sistemas web"], ["created_at", "2021-03-22 18:42:42.301537"], ["updated_at", "2021-03-22 18:42:42.301537"]]

  def edit
    @note = Note.find(params[:id])
---
SELECT "notes".* FROM "notes" WHERE "notes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def update
    @note = Note.find(params[:id])

    if @note.update(note_params)
---
SELECT "notes".* FROM "notes" WHERE "notes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "notes" SET "body" = ?, "updated_at" = ? WHERE "notes"."id" = ?  [["body", "Desarrollo de sistemas web\r\nEditado"], ["updated_at", "2021-03-22 18:42:54.484612"], ["id", 2]]

  def destroy
    @note = Note.find(params[:id])
    @note.destroy
---
SELECT "notes".* FROM "notes" WHERE "notes"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
DELETE FROM "notes" WHERE "notes"."id" = ?  [["id", 2]]